{
  "backend/main.mo": "Main canister logic handling user registration, labour profile CRUD, availability updates, and access control via authorization and storage mixins.",
  "backend/migration.mo": "Defines old/new state formats and a minimal migration that initializes empty user and labour maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files used across the app.",
  "frontend/index.css": "Global Tailwind-based theme definitions using OKLCH variables for light and dark modes.",
  "frontend/index.html": "Basic HTML template mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Central app router controlling screen navigation based on Internet Identity auth, role selection, and labour profile completeness.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the authenticated/anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, and logout states.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles, labour profiles, registration, updates, availability, and filtered labour search.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/areaOptions.ts": "Exports fixed area selection options used in forms.",
  "frontend/src/lib/skillOptions.ts": "Exports preset labour skill options for filtering and profile editing.",
  "frontend/src/lib/whatsapp.ts": "Opens a WhatsApp chat window for a given phone number.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/screens/CustomerHomeScreen.tsx": "UI for customers to filter labour by skill and area, display results, and contact workers via WhatsApp.",
  "frontend/src/screens/LabourEditProfileScreen.tsx": "Form screen for labourers to load, edit, validate, and save their profile data.",
  "frontend/src/screens/LabourHomeScreen.tsx": "Displays a labourer's profile with availability toggling, logout, and navigation to edit profile.",
  "frontend/src/screens/LabourProfileSetupScreen.tsx": "Form screen for labour users to submit name, phone, skill, area, wage, and availability, then save via updateLabourProfile.",
  "frontend/src/screens/LabourRegistrationScreen.tsx": "Empty/placeholder screen with no implemented content.",
  "frontend/src/screens/LoginScreen.tsx": "Login screen using Internet Identity with a button that triggers login and shows a loading state.",
  "frontend/src/screens/SelectRoleScreen.tsx": "Lets users pick labour or customer role and registers it via backend, showing processing states.",
  "frontend/src/screens/SplashScreen.tsx": "Simple splash screen displaying the RozKaam title and tagline.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, containers, and plugins.",
  "project_state.json": "Metadata describing project features, architecture notes, requirements, and current state."
}